## Lesson 5: `.str` and `.dt` accessor

In [2]:
import pandas as pd
import numpy as np
import re

In [4]:
data = pd.Series(['peter', 'Paul', None, 'MARY', 'gUIDO'])
# This would fail with a standard loop
#[s.capitalize() for s in data] # -> Raises an error because of None
# The correct way with Pandas
print(data.str.capitalize())

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

In [5]:
data = pd.Series(['peter', 'Paul', "None", 'MARY', 'gUIDO'])
# This would fail with a standard loop
%timeit [s.capitalize() for s in data] # -> Raises an error because of None

2.64 μs ± 92.4 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [6]:
# The correct way with Pandas
%timeit data.str.capitalize()

83.4 μs ± 1.51 μs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [7]:
s = pd.Series([' house ', 'kitchen', 'BATHROOM '])
# Case normalization
print("Upper case:\n", s.str.upper())

Upper case:
 0       HOUSE
1      KITCHEN
2    BATHROOM
dtype: object

In [8]:
# Stripping whitespace
print("\nStripped:\n", s.str.strip())

Stripped:
 0       house
1     kitchen
2    BATHROOM
dtype: object

In [9]:
# Replacing strings
print("\nReplaced:\n", s.str.replace(' ', '_'))

Replaced:
 0      _house_
1      kitchen
2    BATHROOM_
dtype: object

In [10]:
s = pd.Series(['apple', 'banana', 'apricot', 'blueberry'])

# Check for substring existence (case-insensitive)
print("Contains 'A' (case-insensitive):\n", s.str.contains('A', case=False))

Contains 'A' (case-insensitive):
 0     True
1     True
2     True
3    False
dtype: bool

In [12]:

# Check if string starts with...
print("\nStarts with 'a':\n", s.str.startswith('a'))

Starts with 'a':
 0     True
1    False
2     True
3    False
dtype: bool

In [13]:

# Check if string ends with...
print("\nEnds with 't':\n", s.str.endswith('t'))

Ends with 't':
 0    False
1    False
2     True
3    False
dtype: bool

In [15]:
df_retail = pd.read_excel('Data/Online_Retail.xlsx')
df_retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [22]:
indC = df_retail['InvoiceNo'].astype(str).str.contains('C',case=False)
df_retail[indC][df_retail['Quantity']>0]

C:\Users\Admin\AppData\Local\Temp\ipykernel_3560\1547690477.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_retail[indC][df_retail['Quantity']>0]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In [27]:
s = pd.Series(['a_b _c', 'c_d_e', 'f_g _h'])
# Split the string, returns a Series of lists
print(s.str.split('_'))

0    [a, b , c]
1     [c, d, e]
2    [f, g , h]
dtype: object

In [25]:
# Access elements of the split lists
print("\nSecond element:\n", s.str.split('_').str.get(1))

Second element:
 0    b
1    d
2    g
dtype: object

In [28]:
# Expand into a DataFrame, with each element in a column
print("\nExpanded DataFrame:\n", s.str.split(expand=True))

Expanded DataFrame:
        0     1
0    a_b    _c
1  c_d_e  None
2    f_g    _h

In [29]:
df_lab1 = pd.DataFrame({
    'full_name': ['  John Smith ', 'Jane Doe', '  peter jones  '],
    'location': ['123 Main St, New York, USA', '456 Oak Ave, London, UK', '789 Pine Ln, New York, USA']
})

In [31]:
df_lab1['name_clean'] = df_lab1['full_name'].str.strip().str.title()
df_lab1

         full_name                    location   name_clean
0      John Smith   123 Main St, New York, USA   John Smith
1         Jane Doe     456 Oak Ave, London, UK     Jane Doe
2    peter jones    789 Pine Ln, New York, USA  Peter Jones

In [33]:
df_lab1[['street','city','country']] = df_lab1['location'].str.split(',', expand= True)
df_lab1

,full_name,location,name_clean,street,city,country
0,John Smith,"123 Main St, New York, USA",John Smith,123 Main St,New York,USA
1,Jane Doe,"456 Oak Ave, London, UK",Jane Doe,456 Oak Ave,London,UK
2,peter jones,"789 Pine Ln, New York, USA",Peter Jones,789 Pine Ln,New York,USA

In [36]:
df_lab1[df_lab1['location'].str.contains('New York')]

,full_name,location,name_clean,street,city,country
0,John Smith,"123 Main St, New York, USA",John Smith,123 Main St,New York,USA
2,peter jones,"789 Pine Ln, New York, USA",Peter Jones,789 Pine Ln,New York,USA

In [37]:
s = pd.Series(['Apple', 'Banana', 'apricot', 'Avocado'])
# Without flags (case-sensitive)
# Checks if the string STARTS with 'A'
print("Starts with 'A' (case-sensitive):\n", s.str.match(r'A.*'))

Starts with 'A' (case-sensitive):
 0     True
1    False
2    False
3     True
dtype: bool

In [38]:
# With flags (case-insensitive)
# Checks if the string STARTS with 'a' or 'A'
print("\nStarts with 'a' (case-insensitive):\n", s.str.match(r'a.*',flags=re.IGNORECASE))

Starts with 'a' (case-insensitive):
 0     True
1    False
2     True
3     True
dtype: bool

In [39]:
indC = df_retail['InvoiceNo'].astype(str).str.contains('C',case=False, flags=re.I)
df_retail[indC][df_retail['Quantity']>0]

C:\Users\Admin\AppData\Local\Temp\ipykernel_3560\754281172.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_retail[indC][df_retail['Quantity']>0]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In [40]:
s = pd.Series(['ID: A123', 'id: b456', 'No ID here'])
# Without flags (case-sensitive) - will miss 'id: b456'
print("Extract number after 'ID: ':\n", s.str.extract(r'ID: [A-Z](\d+)'))
# With flags (case-insensitive)
print("\nExtract number after 'id: ' (case-insensitive):\n", s.str.extract(r'id: [a-z](\d+)', flags=re.I))

Extract number after 'ID: ':
      0
0  123
1  NaN
2  NaN

Extract number after 'id: ' (case-insensitive):
      0
0  123
1  456
2  NaN

In [44]:
s = pd.Series(['#sale #promo', '#Sale #new', '#shipping'])
# Without flags (case-sensitive) - finds only lowercase hashtags
print("Find all lowercase hashtags:\n", s.str.findall(r'#[a-z]+'))

Find all lowercase hashtags:
 0    [#sale, #promo]
1             [#new]
2        [#shipping]
dtype: object

In [47]:
s.str.extract(r'#([a-z]+)')

          0
0      sale
1       new
2  shipping

In [48]:

# With flags (case-insensitive) - finds all hashtags
print("\nFind all hashtags (case-insensitive):\n", s.str.findall(r'#([a-z]+)', flags=re.IGNORECASE))

Find all hashtags (case-insensitive):
 0    [sale, promo]
1      [Sale, new]
2       [shipping]
dtype: object

In [50]:
df_comments = pd.DataFrame({
        'comments': ['REF-1234: Great product!',
                     'Complaint: The item (REF-5678) was broken.',
        'REF-9101, love it! #awesome #greatbuy',
        'This is not a valid comment',
        'complaint: another issue with REF-1122']})

### Tasks:
1. Validate Comments (.str.match()): Create a boolean Series is_valid that is True for comments that start with either "REF" or "Complaint". Use a case-insensitive flag. (Hint: .r'(REF|Complaint).*')

In [53]:
df_comments['is_valid'] = df_comments['comments'].str.match(r'(REF|Complaint).*',flags=re.I)
df_comments

                                     comments  is_valid
0                    REF-1234: Great product!      True
1  Complaint: The item (REF-5678) was broken.      True
2       REF-9101, love it! #awesome #greatbuy      True
3                 This is not a valid comment     False
4      complaint: another issue with REF-1122      True

2. Categorize Complaints (.str.contains()): Using the original df_comments, create a new DataFrame complaints_df that contains only comments that include the word "complaint" (case-insensitive).

In [ ]:
df_comments[df_comments['comments'].str.contains(r'complaint', flags=re.I)]

                                     comments  is_valid
1  Complaint: The item (REF-5678) was broken.      True
4      complaint: another issue with REF-1122      True

3. Extract Reference Numbers (.str.extract()): Create a new column ref_id in the original DataFrame that extracts only the digits from the reference number (e.g., '1234', '5678').

In [ ]:
df_comments['ref_id'] = df_comments['comments'].str.extract(r'REF-(\d+)')
df_comments

,comments,is_valid,ref_id,hashtags
0,REF-1234: Great product!,True,1234,[]
1,Complaint: The item (REF-5678) was broken.,True,5678,[]
2,"REF-9101, love it! #awesome #greatbuy",True,9101,"[#awesome, #greatbuy]"
3,This is not a valid comment,False,NaN,[]
4,complaint: another issue with REF-1122,True,1122,[]

4. Extract Hashtags (.str.findall()): Create a new column hashtags that finds all hashtags (words starting with #) in each comment.

In [64]:
df_comments['hashtags'] = df_comments['comments'].str.findall(r'#[\w-]+')
df_comments

,comments,is_valid,ref_id,hashtags
0,REF-1234: Great product!,True,1234,[]
1,Complaint: The item (REF-5678) was broken.,True,5678,[]
2,"REF-9101, love it! #awesome #greatbuy",True,9101,"[#awesome, #greatbuy]"
3,This is not a valid comment,False,NaN,[]
4,complaint: another issue with REF-1122,True,1122,[]

In [65]:
# Convert strings to datetime, Pandas can often infer the format
dates_str = ['2023-01-01', '2023/01/02', '05-Jan-2023']
dates = pd.to_datetime(dates_str,format="mixed")
print(dates)

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-05'], dtype='datetime64[ns]', freq=None)

In [67]:
dates.year

Index([2023, 2023, 2023], dtype='int32')

In [68]:
dates.month

Index([1, 1, 1], dtype='int32')

In [69]:
dates.day

Index([1, 2, 5], dtype='int32')

In [70]:
dates.month_name()

Index(['January', 'January', 'January'], dtype='object')

In [71]:
dates.day_name()

Index(['Sunday', 'Monday', 'Thursday'], dtype='object')

In [73]:
dates.quarter

Index([1, 1, 1], dtype='int32')

In [75]:
# Handle errors: coerce invalid values to NaT (Not a Time)
bad_dates = ['2023-01-01', 'not a date']
# The errors='coerce' parameter will turn any unparseable date into NaT (Not a Time),
# which is Pandas' equivalent of NaN for datetime objects. This prevents the code from crashing.
print(pd.to_datetime(bad_dates, errors='coerce'))

DatetimeIndex(['2023-01-01', 'NaT'], dtype='datetime64[ns]', freq=None)

In [76]:
df = pd.DataFrame({
    'sale_date': pd.to_datetime(['2023-01-15', '2023-01-16']),
    'sales': [100, 150]
})
print(df)
print("--- Before setting index ---")
print(df.info())

   sale_date  sales
0 2023-01-15    100
1 2023-01-16    150
--- Before setting index ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   sale_date  2 non-null      datetime64[ns]
 1   sales      2 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 164.0 bytes
None

In [79]:
# Set the 'sale_date' column as the index
df.set_index('sale_date', inplace=True)
print("\n--- After setting index ---")
print(df.info())
print("\nIndex Type:", type(df.index))

--- After setting index ---
<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2 entries, 2023-01-15 to 2023-01-16
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sales   2 non-null      int64
dtypes: int64(1)
memory usage: 32.0 bytes
None

Index Type: <class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [80]:
df

            sales
sale_date
2023-01-15    100
2023-01-16    150

In [82]:
df.index.year

Index([2023, 2023], dtype='int32', name='sale_date')

In [84]:
df.index.day_name()

Index(['Sunday', 'Monday'], dtype='object', name='sale_date')

In [85]:
df = pd.DataFrame({
    'sale_date': pd.to_datetime(['2023-01-15', '2023-01-16']),
    'sales': [100, 150]
})
df

   sale_date  sales
0 2023-01-15    100
1 2023-01-16    150

In [86]:
df['sale_date'].dt.day_name()

0    Sunday
1    Monday
Name: sale_date, dtype: object

In [87]:
[time.day_name() for time in df['sale_date']]

['Sunday', 'Monday']

In [102]:
ts = pd.Series(np.random.randn(1000),
        index=pd.date_range('1/1/2020', periods=1000))
type(ts)

pandas.core.series.Series

In [90]:
ts.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2022-09-17', '2022-09-18', '2022-09-19', '2022-09-20',
               '2022-09-21', '2022-09-22', '2022-09-23', '2022-09-24',
               '2022-09-25', '2022-09-26'],
              dtype='datetime64[ns]', length=1000, freq='D')

In [91]:
# Select a year
print(ts['2021'].head())

2021-01-01    1.432862
2021-01-02    1.378336
2021-01-03    0.922432
2021-01-04   -0.187975
2021-01-05    4.823572
Freq: D, dtype: float64

In [92]:
# Select a month
print(ts['2021-05'].head())

2021-05-01    0.192588
2021-05-02    0.920403
2021-05-03   -0.303804
2021-05-04   -1.829256
2021-05-05    0.260685
Freq: D, dtype: float64

In [93]:
# Slice a date range
ts['2022-01-01':'2022-01-31'].head()

2022-01-01   -0.114034
2022-01-02    1.267016
2022-01-03   -1.508006
2022-01-04   -1.414227
2022-01-05   -0.267457
Freq: D, dtype: float64

In [94]:
ts.head()

2020-01-01   -0.768303
2020-01-02   -0.428605
2020-01-03    0.299062
2020-01-04    0.447997
2020-01-05   -1.540372
Freq: D, dtype: float64

In [103]:
ts[ts.index.quarter==2]['2021']

2021-04-01   -0.485019
2021-04-02   -0.488265
2021-04-03    1.420874
2021-04-04   -0.254402
2021-04-05    0.468587
                ...
2021-06-26   -1.431186
2021-06-27    0.891126
2021-06-28   -0.017473
2021-06-29    1.218769
2021-06-30   -2.300761
Length: 91, dtype: float64

In [105]:
df_ts = pd.DataFrame({'ts':ts,
                      'day_name':ts.index.day_name()})
df_ts.head()

                  ts   day_name
2020-01-01  1.067809  Wednesday
2020-01-02  0.910131   Thursday
2020-01-03  0.392731     Friday
2020-01-04 -0.799844   Saturday
2020-01-05 -0.452975     Sunday

In [107]:
ts.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2022-09-17', '2022-09-18', '2022-09-19', '2022-09-20',
               '2022-09-21', '2022-09-22', '2022-09-23', '2022-09-24',
               '2022-09-25', '2022-09-26'],
              dtype='datetime64[ns]', length=1000, freq='D')

In [108]:
df_ts['day of week'] = ts.index.day_of_week
df_ts.head()

                  ts   day_name  day of week
2020-01-01  1.067809  Wednesday            2
2020-01-02  0.910131   Thursday            3
2020-01-03  0.392731     Friday            4
2020-01-04 -0.799844   Saturday            5
2020-01-05 -0.452975     Sunday            6

In [109]:
df_sales = pd.DataFrame({
    'date': ['2023-01-29', '2023-01-30', '2023-02-01', '2023-02-02', '2023-02-03'],
    'sales': [250, 275, 310, 290, 350]})

In [110]:
df_sales

         date  sales
0  2023-01-29    250
1  2023-01-30    275
2  2023-02-01    310
3  2023-02-02    290
4  2023-02-03    350

In [113]:
df_sales['date'] = pd.to_datetime(df_sales['date'], errors='coerce')

In [117]:
df_sales.set_index('date', inplace=True)

KeyError: "None of ['date'] are in the columns"

In [118]:
df_sales

            sales
date
2023-01-29    250
2023-01-30    275
2023-02-01    310
2023-02-02    290
2023-02-03    350

In [119]:
df_sales['day of week'] = df_sales.index.day_of_week

In [120]:
df_sales

            sales  day of week
date
2023-01-29    250            6
2023-01-30    275            0
2023-02-01    310            2
2023-02-02    290            3
2023-02-03    350            4

In [122]:
df_ts.head(5)

                  ts   day_name  day of week
2020-01-01  1.067809  Wednesday            2
2020-01-02  0.910131   Thursday            3
2020-01-03  0.392731     Friday            4
2020-01-04 -0.799844   Saturday            5
2020-01-05 -0.452975     Sunday            6

In [130]:
df_ts[['ts','day of week']].groupby('day of week').mean().sort_values(by='ts', ascending=False)

                   ts
day of week
3            0.101615
0            0.070168
2            0.042524
1           -0.025738
5           -0.083291
4           -0.120222
6           -0.149143

In [131]:
df_retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom